; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	image3 - mode
	image1 - mode
	image2 - mode
	infrared0 - mode
	Star0 - direction
	Star3 - direction
	GroundStation5 - direction
	Star1 - direction
	Star2 - direction
	GroundStation4 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Star9 - direction
	Phenomenon10 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 image2)
	(supports instrument1 image3)
	(calibration_target instrument1 Star1)
	(supports instrument2 image2)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
	(supports instrument3 infrared0)
	(calibration_target instrument3 GroundStation4)
	(supports instrument4 image2)
	(calibration_target instrument4 Star2)
	(calibration_target instrument4 GroundStation4)
	(supports instrument5 image2)
	(calibration_target instrument5 Star1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star0)
	(supports instrument6 image3)
	(supports instrument6 image2)
	(calibration_target instrument6 Star2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star3)
	(supports instrument7 image3)
	(supports instrument7 infrared0)
	(calibration_target instrument7 GroundStation4)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon10)
)
(:goal (and
	(pointing satellite2 GroundStation5)
	(have_image Phenomenon6 image3)
	(have_image Phenomenon7 image1)
	(have_image Planet8 image2)
	(have_image Star9 image2)
	(have_image Phenomenon10 image3)
))

)

; plan
1. (turn_to satellite2 star2 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 star2)
   goals met: 0 of 6
2. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 0 of 6
3. (calibrate satellite2 instrument6 star2)
   added: (calibrated instrument6)
   goals met: 0 of 6
4. (turn_to satellite2 phenomenon6 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 phenomenon6)
   goals met: 0 of 6
5. (take_image satellite2 phenomenon6 instrument6 image3)
   added: (have_image phenomenon6 image3)
   goals met: 1 of 6
6. (turn_to satellite2 phenomenon10 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 phenomenon10)
   goals met: 1 of 6
7. (turn_to satellite0 groundstation4 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 groundstation4)
   goals met: 1 of 6
8. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 6
9. (calibrate satellite0 instrument0 groundstation4)
   added: (calibrated instrument0)
   goals met: 1 of 6
10. (take_image satellite2 phenomenon10 instrument6 image3)
   added: (have_image phenomenon10 image3)
   goals met: 2 of 6
11. (turn_to satellite0 phenomenon7 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 phenomenon7)
   goals met: 2 of 6
12. (take_image satellite0 phenomenon7 instrument0 image1)
   added: (have_image phenomenon7 image1)
   goals met: 3 of 6
13. (turn_to satellite2 planet8 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 planet8)
   goals met: 3 of 6
14. (take_image satellite2 planet8 instrument6 image2)
   added: (have_image planet8 image2)
   goals met: 4 of 6
15. (turn_to satellite2 star9 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 star9)
   goals met: 4 of 6
16. (take_image satellite2 star9 instrument6 image2)
   added: (have_image star9 image2)
   goals met: 5 of 6
17. (turn_to satellite2 groundstation5 star9)
   deleted: (pointing satellite2 star9)
   added: (pointing satellite2 groundstation5)
   goals met: 6 of 6
